# print("Hello world!!!")

# # Возведение в степень
# print(5 ** 2)  # 5 в квадрате
# print(5 ** 3)  # 5 в кубе
#..............................................................................

# # Операторы сравнения
# print(4 < 7)   # 4 меньше 7
# print(7 > 4)   # 7 больше 4
# print(7 >= 4)  # 7 больше или равно 4
# print(4 <= 7)  # 4 меньше или равно 7
# print(4 != 7)  # 4 не равно 7
#..............................................................................

# # Ввод и вывод данных пользователем:
# # Запрашиваем три названия языков программирования
# language1 = input("Введите первый язык программирования: ")
# language2 = input("Введите второй язык программирования: ")
# language3 = input("Введите третий язык программирования: ")

# # Выводим все три языка через одну функцию print
# print(f"Вы ввели следующие языки программирования: {language1}, {language2}, {language3}.")
#..............................................................................

# # Расчёт расстояния до работы в километрах
# # Запрашиваем расстояние до работы в километрах
# distance_km = float(input("Введите расстояние до работы в километрах: "))

# # Переводим километры в мили (1 миля = 1.6 км)
# distance_miles = distance_km / 1.6

# # Выводим результат
# print(f"Расстояние до работы в милях: {distance_miles:.2f}")
#..............................................................................































































