# print("Hello world!!!")

# # Возведение в степень
# print(5 ** 2)  # 5 в квадрате
# print(5 ** 3)  # 5 в кубе
#..............................................................................

# # Операторы сравнения
# print(4 < 7)   # 4 меньше 7
# print(7 > 4)   # 7 больше 4
# print(7 >= 4)  # 7 больше или равно 4
# print(4 <= 7)  # 4 меньше или равно 7
# print(4 != 7)  # 4 не равно 7
#..............................................................................

# # Ввод и вывод данных пользователем:
# # Запрашиваем три названия языков программирования
# language1 = input("Введите первый язык программирования: ")
# language2 = input("Введите второй язык программирования: ")
# language3 = input("Введите третий язык программирования: ")

# # Выводим все три языка через одну функцию print
# print(f"Вы ввели следующие языки программирования: {language1}, {language2}, {language3}.")
#..............................................................................

# # Расчёт расстояния до работы в километрах
# # Запрашиваем расстояние до работы в километрах
# distance_km = float(input("Введите расстояние до работы в километрах: "))

# # Переводим километры в мили (1 миля = 1.6 км)
# distance_miles = distance_km / 1.6

# # Выводим результат
# print(f"Расстояние до работы в милях: {distance_miles:.2f}")
#..............................................................................

# # Условные_операторы_и_Циклы_в_Python
# # 
# # Правильный пароль
# correct_password = "python123"

# # Запрашиваем пароль у пользователя
# user_password = input("Введите пароль: ")

# # Проверяем, совпадает ли введённый пароль с правильным
# if user_password == correct_password:
#     print("Добро пожаловать")
# else:
#     print("Вам отказано в доступе")
#..............................................................................

# # цикл while
# # Начальное значение
# number = 58

# # Используем цикл while, чтобы выводить числа от 58 до 50
# while number >= 50:
#     print(number)
#     number -= 1  # Уменьшаем число на 1 в каждой итерации
#..............................................................................

# # Экзаменационая оценка:
# # Вводим количество баллов
# score = int(input("Введите количество баллов (от 0 до 100): "))

# # Оценка "Отлично"
# if score >= 90:
#     print("Оценка: Отлично")

# # Оценка "Хорошо"
# elif score >= 70:
#     print("Оценка: Хорошо")

# # Оценка "Удовлетворительно"
# elif score >= 50:
#     print("Оценка: Удовлетворительно")

# # Провал (если баллов меньше 50)
# else:
#     print("Экзамен не сдан. Пройдите пересдачу.")

# # Важное отличие: после elif всегда идёт ещё одно условие, которое нужно проверить.
#..............................................................................

# КПП парковки для авто
# Изначально парковка пуста
total_places = 8  # общая вместимость парковки
free_places = total_places  # количество свободных мест

# Цикл выполняется, пока есть свободные места
while free_places > 0:
    print("Машина заехала")
    free_places -= 1  # уменьшение количества свободных мест
    print(f"Свободных мест на парковке: {free_places}")

# Когда парковка заполнена
print("Места на парковке больше нет.")
#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................

# 

#..............................................................................





















































